"""
מודול קבועים עבור משחק פקמן.

מכיל:
- הגדרות חלון (רוחב, גובה, כותרת)
- גודל אריח בודד במפה
- מפה לוגית (LEVEL_MAP) שמגדירה קירות, מטבעות, פקמן ורוחות.
"""
LEVEL_MAP=[]
# הגדרות חלון
with open("text.txt","r") as file:
    for row in file:
        LEVEL_MAP.append(row.strip())
print(LEVEL_MAP)

WINDOW_WIDTH = 800
WINDOW_HEIGHT = 600
WINDOW_TITLE = "Pacman Arcade Example"

# גודל אריח במפה (בפיקסלים)
TILE_SIZE = 32

# מפה:
# # - קיר
# . - מטבע
# P - פקמן (נקודת התחלה לשחקן)
# G - רוח
#LEVEL_MAP = [
 #   "########################",
  #  "#..........##..........#",
   # "#.####.###.##.###.####.#",
    #"#P....................G#",
    #"########################",
#]
